CFD/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: 
// Export date: 2022-06-10 16:53:22.054375

scale 1;

vertices
(
    ( -0.027 -0.027 -0.0 )
    ( 0.027 -0.027 -0.0 )
    ( 0.027 0.027 -0.0 )
    ( -0.027 0.027 -0.0 )
    ( -0.027 -0.027 0.41 )
    ( 0.027 -0.027 0.41)
    ( 0.027 0.027 0.41)
    ( -0.027 0.027 0.41 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 8 64) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall inlet
    (
        (0 3 2 1)
    )
    wall outlet
    (
        (4 5 6 7)
    )
    wall wall
    (
        (3 7 6 2)
        (1 5 4 0)
        (0 4 7 3)
        (2 6 5 1)
    )
);
boundary
(
);

