CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    nozzle
    {
        type            noSlip;
    }
    inlet
    {
	/*
	type            interstitialInletVelocity;
        alpha           voidfraction;
        inletVelocity   uniform (0 0 1.5);
	value		uniform (0 0 1.5);
	*/

	type            uniformFixedValue;
        uniformValue     table
        (
            // (0.00 (0 0 0.000))
            // (0.50 (0 0 0.000))
            // (0.60 (0 0 0.050))
            // (1.60 (0 0 0.050))
            // (1.70 (0 0 0.100))
            // (2.70 (0 0 0.100))
            // (2.80 (0 0 0.125))
            // (3.80 (0 0 0.125))
            // (3.90 (0 0 0.150))
            // (4.90 (0 0 0.150))
            // (5.00 (0 0 0.175))
            // (6.00 (0 0 0.175))
            // (6.10 (0 0 0.200))
            // (7.10 (0 0 0.200))
            // (7.20 (0 0 0.175))
            // (8.20 (0 0 0.175))
            // (8.30 (0 0 0.15))
            // (9.30 (0 0 0.15))
            // (9.40 (0 0 0.125))
            // (10.40 (0 0 0.125))
            // (10.50 (0 0 0.100))
            // (11.50 (0 0 0.100))
            // (11.60 (0 0 0.050))
            // (12.60 (0 0 0.050))
            // (12.70 (0 0 0.000))
            // (13.70 (0 0 0.000))
            (0.00 (0 0 0.0000))
            (0.50 (0 0 0.0000))
            (0.60 (0 0 0.0050))
            (1.60 (0 0 0.0050))
            (1.70 (0 0 0.0100))
            (2.70 (0 0 0.0100))
            (2.80 (0 0 0.0125))
            (3.80 (0 0 0.0125))
            (3.90 (0 0 0.0150))
            (4.90 (0 0 0.0150))
            (5.00 (0 0 0.0175))
            (6.00 (0 0 0.0175))
            (6.10 (0 0 0.0200))
            (7.10 (0 0 0.0200))
            (7.20 (0 0 0.0175))
            (8.20 (0 0 0.0175))
            (8.30 (0 0 0.015))
            (9.30 (0 0 0.015))
            (9.40 (0 0 0.0125))
            (10.40 (0 0 0.0125))
            (10.50 (0 0 0.0100))
            (11.50 (0 0 0.0100))
            (11.60 (0 0 0.0050))
            (12.60 (0 0 0.0050))
            (12.70 (0 0 0.000))
            (13.70 (0 0 0.000))

        );
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            noSlip;
    }
    tube
    {
        type            noSlip;
    }
}


// ************************************************************************* //
