CFD/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0012012;

boundaryField
{
    nozzle
    {
        type            epsilonWallFunction;
        value           uniform 0.0012012;
    }
/*
    inlet_inner
    {
        type            fixedValue;
        value           uniform 0.2118;
    }
    inlet_outer
    {
        type            fixedValue;
        value           uniform 0.0012012;
    }*/
    
    inlet
    {
	type            fixedValue;
	value           uniform 0.2118;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            epsilonWallFunction;
        value           uniform 0.0012012;
    }
    tube
    {
        type            epsilonWallFunction;
        value           uniform 0.0012012;
    }
}


// ************************************************************************* //
