CFD/0/voidfraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      voidfraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;


boundaryField
{
    nozzle
    {
        type            zeroGradient;
    }
/*
    inlet_inner
    {
        type            fixedValue;
        value           uniform 1;
    }
    inlet_outer
    {
        type            fixedValue;
        value           uniform 1;
    }*/
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
	type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    tube
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
