CFD/system/old_blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
vertices
(

    (-0.15 -0.15 -.05  )
    ( 0.15 -0.15 -.05  )
    ( 0.15  0.15 -.05  )
    (-0.15  0.15 -.05  )

    (-0.15 -0.15 .206  )
    ( 0.15 -0.15 .206  )
    ( 0.15  0.15 .206  )
    (-0.15  0.15 .206  )

    (-0.15 -0.15  .86)
    ( 0.15 -0.15  .86)
    ( 0.15  0.15  .86)
    (-0.15  0.15  .86)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 60) 
        simpleGrading 
	(
	1
  	1
	1
	)
    hex ( 4 5 6 7 8 9 10 11) (60 60 110) 
        simpleGrading 
	(
	1
	1
	1	
	)


);

edges
(
);

boundary
(
/*
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
*/
);

// ************************************************************************* //

