CFD/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "/home/hanqiaoche/c_disk/cfdem/tapered/IC_tapered_13/CFD/system/surfaces.cfg"

fields       (voidfraction Us);

surfaces
(
    xNormal
    {
        $cuttingPlane;
    }

    zNormal
    {
        $cuttingPlane;
        pointAndNormalDict
        {
            basePoint    (0 0 .12); // Overrides default basePoint (0 0 0)// /default vector was in *.cfg file
            normalVector $z;      // $y: macro for (0 0 1)
        }
    }

);

// ************************************************************************* //
