CFD/system/surfaces.cfg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   vtk;
interpolationScheme cellPoint;

x (1 0 0);// $x
y (0 1 0);// $y
z (0 0 1);// $z
origin (0 0 0);// base point

cuttingPlane
{
    type         cuttingPlane;
    planeType    pointAndNormal;
    pointAndNormalDict
    {
        basePoint    $origin;
        normalVector $x;
    }
    interpolate  true;
}

isosurface
{
    type            isoSurface;
    interpolate     true;
}

patchSurface
{
    type        patch;
    interpolate true;
}

// ************************************************************************* //
